{
  "partnerProjects": [
    {
      "name": "Prophet (with Optimism)",
      "description": "Prophet presents a versatile and fully adaptable optimistic oracle solution, transcending the boundaries of conventional dispute resolution modules. With its emphasis on complete control and modularity across all aspects of the system, Prophet is an open-source public good for the Optimism community.",
      "github": "https://github.com/defi-wonderland/prophet-core",
      "docs": "https://docs.prophet.tech",
      "web": "https://prophet.tech"
    },
    {
      "name": "HAI (with Reflexer)",
      "description": "Fork of the RAI protocol, deployed on Optimism. HAI supports new collaterals such as OP, LSD, and RAI.",
      "github": "https://github.com/hai-on-op",
      "docs": "",
      "twitter": "https://twitter.com/letsgethai",
      "web": "https://www.letsgethai.com"
    },
    {
      "name": "Optimistic Roots (with Connext)",
      "description": "Existing canonical bridge implementations are quite expensive. This project significantly reduces costs and increases transfer speeds by implementing an Optimistic approach with cross-chain Merkle root aggregations.",
      "github": "https://github.com/connext",
      "twitter": "https://twitter.com/ConnextNetwork",
      "web": "https://www.connext.network/"
    },
    {
      "name": "Crosschain Governance (with Connext)",
      "description": "A user-friendly library of React components that empowers users to set up and oversee their Avatar's Zodiac Connext Module. It simplifies the construction of transaction data necessary for implementing preferred actions via an xcall function within Connext.",
      "github": "https://github.com/defi-wonderland/crosschain-widget"
    },
    {
      "name": "xERC20 (with Connext)",
      "description": "xTokens is a standard for bridged tokens. A common interface to be used across different implementations of bridges to keep liquidity concentrated and improve user experience on-chain.",
      "github": "https://github.com/defi-wonderland/xERC20"
    },
    {
      "name": "Amphora",
      "description": "Amphora, a lending market forked from Interest Protocol, accommodates diverse collateral forms including single-type ones like ETH and Curve's liquidity provider tokens, like TriCrypto2. Additionally, it offers a USDA stablecoin.",
      "docs": "https://amphora-protocol.gitbook.io/amphora-protocol/",
      "twitter": "https://twitter.com/amphoraprotocol"
    },
    {
      "name": "Keep3r Network v2",
      "description": "Decentralized and permissionless network for projects that need external DevOps. We rebuilt the protocol from scratch, improving the code quality, gas usage, and tokenomics. We also added automatic credit mining.",
      "github": "https://github.com/keep3r-network/keep3r-network-v2",
      "twitter": "https://twitter.com/thekeep3r",
      "web": "https://keep3r.network"
    },
    {
      "name": "Royalties Support (with Sudoswap)",
      "description": "The Router is an independent system that grants royalties by accessing the Manifold.xyz Royalty Registry. Currently, this tool is operational and actively utilized by Reservoir.",
      "github": "https://github.com/sudoswap/lssvm/pull/35"
    }
  ],
  "publicGoods": [
    {
      "name": "Price Oracle",
      "description": "Price is a permissionless and reliable oracle solution that provides safe token price quotes by leveraging Uniswap V3 and automation. The team was responsible for the architecture and tokenomics design, UI, off-chain scripts, and smart contract development.",
      "website": "https://oracles.rip",
      "docs": "https://docs.oracles.rip",
      "github": "https://github.com/price-oracle",
      "twitter": "https://twitter.com/price_oracle"
    },
    {
      "name": "Smock",
      "description": "Smock is a Solidity mocking library and Hardhat plugin, used by approximately 800 repositories. It allows developers to form mock Solidity contracts using JavaScript or TypeScript, simplifying smart contract testing and negating the necessity for Solidity mock contracts. Influenced by sinon, sinon-chai, and Python's unittest.mock, Smock presently supports only Hardhat, with future plans to expand to other frameworks like Truffle.",
      "github": "https://github.com/defi-wonderland/smock",
      "docs": "https://smock.readthedocs.io/en/latest/"
    },
    {
      "name": "Sidechain Oracle (with Keep3r Network)",
      "description": "This mechanism provides the price history of Uniswap V3 pools to chains where the pair may not be available or has insufficient liquidity. This is achieved by creating a virtual Uniswap V3 pool with bridged data from Mainnet. The team was responsible for the architecture design, off-chain scripts, and smart contract development. The mechanism has recently been launched and is already working on Optimism and Polygon.",
      "github": "https://github.com/defi-wonderland/sidechain-oracles"
    }
  ]
}
