{
  "partners": [
    {
      "name": "EBO",
      "company": {
        "name": "The Graph",
        "logo": "the-graph.png"
      },
      "tags": [
        "Architecture Design",
        "Idea Generation",
        "Off-Chain",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "The Graph incentive system uses the Epoch Block Oracle to determine the first block of each epoch, which indexers must use to build their Proof of Indexing and receive rewards on Arbitrum One. The challenge lied in accurately identifying and validating the block timestamp to the start of each epoch in other chain to ensure the distribution of rewards and decentralize the current EBO processes."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We developed an optimistic version of EBO that uses Prophet, an optimistic oracle, to map blocks from various chains to epochs on Arbitrum One, introducing an escalating bond mechanism to resolve disputes. This reduces reliance on the Arbitrator single operator, improves security, and allows for decentralized operations with lower initial stakes."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/EBO-core", "https://github.com/defi-wonderland/EBO-agent"
        ],
        "docs": []
      }
    },
    {
      "name": "Knowledge Graph",
      "company": {
        "name": "GEO",
        "logo": "geo.png"
      },
      "tags": [
        "Idea Generation",
        "Research",
        "Architecture Design",
        "Development",
        "Off-Chain",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "The Knowledge Graph is an evolution of the data indexing and querying model in Web3, extending the capabilities of subgraphs by introducing a semantic and relational representation of data.\nHowever, it still faces important challenges, such as defining suitable storage infrastructure, establishing a clear incentive layer, adapting off-chain infrastructure, and addressing issues like ranking, pluralism, and assertion aggregation, key components of the protocol’s design."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We are participating in The Graph working groups to contribute to the development of the Knowledge Graph through research, design, and development.\nWe proposed an incentive layer based on the veSystem model to help align protocol participants. We also defined user actions as a basic unit that can be used to build features such as ranking, data aggregation, and pluralism handling.\nAdditionally, we are working on other parts of the system, including storage layer and off-chain components. The project is currently under development."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/graphprotocol/graph-improvement-proposals/blob/main/grcs/0020-knowledge-graph.md"
        ],
        "docs": []
      }
    },
    {
      "name": "xKeep3r",
      "company": {
        "name": "Keep3r",
        "logo": "keep3r.png"
      },
      "tags": ["Research", "Smart Contracts", "UI Development"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Building a seamless, fee-less, and permissionless framework for on-chain automation that supports multiple keeper networks (e.g., Gelato, Keep3r) while simplifying job creation for developers."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Keep3r Frameworks provides boilerplate contracts and tooling to easily create jobs managed by Gelato, Autonolas, or any keeper. It aims to be a public good for on-chain automation."
        }
      },
      "status": "Completed",
      "links": {
        "website": ["https://xkeeper.network"],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/xkeeper-core"]
      }
    },
    {
      "name": "ILLA",
      "company": {
        "name": "Layer3",
        "logo": "layer3.png"
      },
      "tags": [
        "Architecture Design",
        "Development",
        "Off-Chain",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Conversational interfaces surged and money became programmable, but there was no reliable layer to turn natural-language intent into executed transactions. LLMs could parse “Send USD 100 to mom,” and rails could move value, yet teams kept rebuilding the middle-planning, routing, transaction construction, simulation/safety, and approvals-resulting in brittle, one‑off systems that couldn’t meet cross‑rail, compliance, or reliability needs."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Illa is the conversation-to-execution infrastructure for finance. With our MCP Tools, SDK, and Widget, apps and agents turn plain English into executable transaction packages. Intent → Orchestration → Execution. The core engine integrates model abstraction, intent recognition, dynamic planning, protocol‑aware routing, a universal transaction compiler, and predictive safety. It’s rail and wallet‑agnostic, configurable via the Developer Console and Agent Studio (limits, confirmations, protocol preferences, analytics). In short, Illa makes “Send 100 to mom” or “Invest 250 in the S&P 500” safe, consistent, and scalable."
        }
      },
      "status": "In progress",
      "links": {
        "website": [
          "https://illalabs.io"
        ],
        "twitter": [],
        "github": [],
        "docs": []
      }
    },
    {
      "name": "$L3",
      "company": {
        "name": "Layer3",
        "logo": "layer3.png"
      },
      "tags": [
        "Architecture Design",
        "Development",
        "Smart Contracts",
        "UI Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Over time, the L3 token has had a North Star: ensuring that token rewards have a positive impact on the growth of the platform. This included finding scalable solutions to improve eligibility and distribute airdrops to up to 400k users, minimizing risks, and supporting staking rewards. Most recently, it involved finding a convenient method to bridge the token to Solana to expand its ecosystem."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We contributed to the tokenomics and staking mechanisms to better reward meaningful contributions. A contract was developed using Safe and delegatecall, streamlining Quest actions into a single transaction.\n\nA React app was built to manage the airdrop, incorporating security features such as wallet screening, VPN detection, Merkle tree generation, and CAPTCHA verification.\n\nWe also took charge of launching L3 on Solana, utilizing Wormhole architecture and implementing the first staking contracts."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [],
        "docs": []
      }
    },
    {
      "name": "Aztec Boilerplate",
      "company": {
        "name": "Aztec",
        "logo": "aztec.png"
      },
      "tags": [
        "Architecture Design",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Building on Aztec should be simple, but developers were missing a unified toolkit that takes care of setup, structure, and best practices. Instead of wasting time researching the latest tools and figuring out standards, they should be focusing on what really matters: building powerful, private smart contracts."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "The Aztec Boilerplate delivers a modern, preconfigured foundation for developing private smart contracts on Aztec. It includes a clean repository structure, integrated unit and end-to-end testing, and automated GitHub workflows, all designed to get developers building fast. With the built-in Aztec Benchmark Tool for comparing gas and gate usage across code versions, the boilerplate ensures every project starts with optimal efficiency and performance from day one."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/aztec-boilerplate"
        ],
        "docs": []
      }
    },
    {
      "name": "Aztec Standards",
      "company": {
        "name": "Aztec",
        "logo": "aztec.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "As the Aztec developer community grows, the need for shared foundations becomes critical to prevent fragmentation and ensure interoperability. Developers require consistent, secure, and composable building blocks that let them focus on innovation rather than reinventing core components. Standardized, reusable contracts are key to maintaining a unified ecosystem of privacy-preserving applications built on familiar patterns."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Aztec Standards provides a complete suite of reusable, standardized contracts designed specifically for the Aztec Network. These standards establish reliable token primitives and utilities that power both private and public operations, giving developers the confidence and flexibility to build advanced, privacy-first applications. By setting a clear foundation, Aztec Standards makes it easier than ever to create secure and interoperable private smart contracts."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/aztec-standards"
        ],
        "docs": []
      }
    },
    {
      "name": "ETHLockbox",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "ETH withdrawals can fail if a chain’s OptimismPortal doesn’t have enough ETH, forcing users to withdraw only from the chain where they originally deposited. This fragments liquidity, complicates UX, and breaks the seamless cross-chain experience the Superchain aims to provide."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "The SharedLockbox unifies ETH liquidity across all OP chains in a single L1 contract. Each OptimismPortal locks and unlocks ETH through this shared pool, allowing withdrawals from any chain. Managed by SuperchainConfig, which authorizes portals and tracks dependencies, and supported by a LiquidityMigrator for existing balances, this design simplifies liquidity management and ensures smooth, interoperable ETH withdrawals."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/ethereum-optimism/design-docs/blob/main/protocol/eth-shared-lockbox.md"
        ],
        "docs": []
      }
    },
    {
      "name": "Revenue Sharing. Fee Splitter",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Current fee sharing on OP Stack chains is rigid and manual, fixed splits don’t support custom revenue policies, multiple destinations, or flexible logic per chain. Chains need a safe, configurable way to automate revenue sharing while keeping compatibility with existing FeeVaults."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Introduce a FeeSplitter predeploy that aggregates fees from all vaults, calls a configurable SharesCalculator to determine recipients and amounts, and disburses funds automatically. Anyone can call disburseFees() once conditions are met. Each chain can define its own revenue-sharing logic (e.g. the SuperchainRevShareCalculator splits fees 2.5% of gross or 15% of net to the revenue-share recipient). Validates vault configs, calculator outputs, and recipient payments; reverts on misconfigurations or failed transfers."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/ethereum-optimism/design-docs/blob/main/protocol/fee-splitter.md"
        ],
        "docs": []
      }
    },
    {
      "name": "Permissionless Proposals",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Optimism’s proposal process is still manual and off-chain, requiring forum coordination and a manager to submit proposals. This centralization slows governance and limits participation."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Add a ProposalValidator contract that automates proposal validation and forwarding to the Governor. It enforces delegate approvals, submission windows, and proposal-type rules on-chain, allowing any eligible or permissionless proposer to submit without manual gatekeeping — while keeping veto and safety checks intact."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/ethereum-optimism/design-docs/pull/260"
        ],
        "docs": []
      }
    },
    {
      "name": "Remote Tokens",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Actions like Uniswap swaps can’t natively execute across OP chains, and liquidity becomes siloed per chain. There’s no standard mechanism for minting and routing remote tokens or ensuring atomic execution between message-passing, token transfers, and protocol calls."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "The system introduces RefTokens and a unified RefTokenBridge to enable atomic, message-based execution across OP chains. Each RefToken is a deterministic, mint-on-arrival representation of a canonical ERC20 scoped by (origin chainId, origin token). The RefTokenBridge locks canonical tokens on the source chain, sends crosschain messages, and mints corresponding RefTokens on the destination chain, routing them to protocol executors like UniSuperExecutor."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/op-ref-tokens"
        ],
        "docs": []
      }
    },    
    {
      "name": "Custom Gas Token",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "The previous Custom Gas Token design was restrictive and tightly coupled to an L1 ERC-20. This made it difficult to launch chains with native assets not yet deployed as ERC20s, integrate with tokens that don't live on L1, or experiment with novel supply and bridging mechanisms."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "The new CGT architecture introduces a minimal, token-agnostic design that decouples gas token logic from the OP Stack core. A single isCustomGasToken() flag disables ETH flows in bridging functions, while two lightweight predeploys, NativeAssetLiquidity and LiquidityController manage native asset issuance flexibly."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/ethereum-optimism/design-docs/blob/main/protocol/custom-gas-token.md?plain=1", "https://github.com/ethereum-optimism/optimism/pull/17412"],
        "docs": []
      }
    },
    {
      "name": "opUSDC",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Fragmentation of USDC across chains due to multiple bridged versions, leading to inefficiencies when it comes to perform a migration path to native USDC issued by Circle."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We developed the architecture for the standard bridged USDC on OP Stack chains, using a Factory on Ethereum to trigger cross-chain deployment of the necessary contracts. Deposits and withdrawals are performed as usual. opUSDC also enables migration to Circle by transferring contract ownership, ensuring seamless upgrades without disruptions."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/opUSDC?tab=readme-ov-file"
        ],
        "docs": []
      }
    },
    {
      "name": "Prophet",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Idea Generation",
        "Smart Contracts",
        "UI Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "We need blockchains to interact with the external world. Oracles are considered the most critical structural components for doing that. While there are various oracles available, non is able to combine decentralization with sustainability."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We built Prophet, an optimistic oracle with a modular resolution system. Instead of relying on a one-size-fits-all resolution scheme, it offers customizable modules that can be tailored to the specific needs of each developer. So, anyone can create their modules, aligning the interests of oracle users and the resolution committee. Now you have: ERC20 custom majority, Optimistic Committee, Arbitrator, Multisig/DAOs, NFTs voting elegibility and more."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/prophet-core"
        ],
        "docs": []
      }
    },
    {
      "name": "SuperchainERC20",
      "company": {
        "name": "Optimism",
        "logo": "optimism.png"
      },
      "tags": [
        "Architecture Design",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "With the introduction of Interop, liquidity across the Superchain needs to be addressed for future tokens to fully leverage the unified ecosystem of hundreds of chains."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We introduced the SuperchainERC20 standard, designed to align with the Superchain architecture and improve interoperability by ensuring tokens share the same contract address across chains. The project involves migrating liquidity and developing tools to facilitate smooth adoption of the standard."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/ethereum-optimism/design-docs/blob/main/protocol/superchain-erc20/superchain-erc20-factory.md"
        ],
        "docs": []
      }
    },
    {
      "name": "Kohaku",
      "company": {
        "name": "Ethereum",
        "logo": "ethereum.png"
      },
      "tags": [
        "Architecture Design",
        "Development",
        "Research",
        "Smart Contracts",
        "UI Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "A public-by-default system is misaligned with how people expect to manage their finances. No one would willingly make every bank payment visible to the world, yet this remains the norm on Ethereum today. For broader adoption, privacy must be a built-in feature, not an optional layer. However, integrating privacy is still complex: developers face fragmented tools, advanced cryptography requirements, and disjointed user experiences. This complexity slows innovation and limits user trust. The technology exists to change this but wallets must evolve to make privacy seamless and native to the on-chain experience."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We work with the Ethereum Foundation to bridge that gap by providing a set of primitives that bring privacy and security directly into wallets. Through its SDK, Kohaku enables the integration of privacy-preserving features such as private send, private receive, and social recovery. All while maintaining modularity and a familiar user experience. The Kohaku Wallet serves as a reference implementation, demonstrating these capabilities in practice. Wonderland is leading the way by integrating Privacy Pools as the first supported protocol, setting the foundation for a privacy-first wallet ecosystem."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": ["https://x.com/DeFi_Wonderland/status/1976723675492814863?s=20"],
        "github": [],
        "docs": []
      }
    },
    {
      "name": "Interoperable Addresses",
      "company": {
        "name": "Ethereum",
        "logo": "ethereum.png"
      },
      "tags": [
        "Off-Chain",
        "Research"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "As the number of rollups and chains grows, interoperability has become a central concern for Ethereum’s usability. Ethereum addresses (ERC-55) lack chain specificity, which can lead to loss of funds in case of errors, and inconsistency as different protocols built their own custom ways to define the chain for a given address."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We wrote ERC-7930, defining an extensible binary format to refer to an address specific to one chain, and co-authored ERC-7828, to make those interoperable addresses human-readable via ENS. We collaborated with the Ethereum Foundation, as well as stakeholders and teams across the Ethereum ecosystem to establish this as the ecosystem’s preferred approach for interoperable addresses. It is a foundational part of the https://www.openintents.xyz/, and we built an SDK for ease of use by wallet and app developers."
        }
      },
      "status": "In progress",
      "links": {
        "website": ["https://www.openintents.xyz/"],
        "twitter": [],
        "github": ["https://github.com/ethereum/L2-interop"],
        "docs": ["https://docs.openintents.xyz/"]
      }
    },
    {
      "name": "Interop",
      "company": {
        "name": "Ethereum",
        "logo": "ethereum.png"
      },
      "tags": [
        "Architecture Design",
        "Development",
        "Idea Generation",
        "Research",
        "Smart Contracts",
        "UI Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Ethereum’s rollup-centric roadmap has unlocked scalability, but at the cost of fragmentation. Liquidity, UX, and developer tooling are now fractured across chains. To enable seamless cross-chain experiences, shared standards are essential."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We are joining forces with the Interop Working Group, led by the Ethereum Foundation, to accelerate interoperability through standardization and system design, guided by a spirit of collaboration. We have authored ERC-7930 and CAIP-350 to establish a global format for chain-specific addresses. In parallel, we are actively contributing to ERC-7828, ERC-7683, and other cross-chain standards. We are also contributing to The Open Intents Framework, a dedicated working group focused on developing tools to democratize access to intent-based products."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://ethereum-magicians.org/t/erc-7930-interoperable-addresses/23365", "https://github.com/ethereum/L2-interop"
        ],
        "docs": []
      }
    },
    {
      "name": "Privacy Pools",
      "company": {
        "name": "0xBow",
        "logo": "0xbow.png"
      },
      "tags": [
        "Architecture Design",
        "Development",
        "Research",
        "Smart Contracts",
        "UI Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "On public blockchains like Ethereum, every transaction is permanently visible to everyone. This means that balances, counterparties, and entire transaction histories are exposed, creating serious privacy and personal safety risks for users. While some privacy tools have attempted to solve this, they often introduced compliance complexity leading to regulatory pushback. The challenge was clear: how to provide strong on-chain privacy and security without sacrificing compliance and usability."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We developed software for 0xbow, the team behind the first implementation of the concept introduced in the Privacy Pools whitepaper, written by Vitalik Butterin, Ameen Soleimani, and Jacob Illum (Chainalysis): a protocol for private withdrawals with compliance built-in, using zk proofs and commitment schemes. An Association Set Provider (ASP) maintains approved deposit sets, ensuring policy compliance while safeguarding privacy."
        }
      },
      "status": "In progress",
      "links": {
        "website": [
          "https://privacypools.com/"
        ],
        "twitter": [],
        "github": [],
        "docs": []
      }
    },
    {
      "name": "Crosschain Governance",
      "company": {
        "name": "Everclear (ex Connext)",
        "logo": "everclear-(ex-connext).png"
      },
      "tags": [
        "Architecture Design",
        "Smart Contracts",
        "UI Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "DAOs, due to their complex nature and the economic and social value they manage, require security and accessibility to function effectively. As DAOs evolve, the ability to safely expand across chains becomes critical for enabling features like token bridging, cross-chain voting, treasury and protocol management."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "A user-friendly React library that allows users to manage their DAO's cross-chain operations via the Zodiac Connext Module. It simplifies the construction of transaction data for implementing actions with the xcall function in Connext."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/crosschain-widget"
        ],
        "docs": []
      }
    },
    {
      "name": "xERC20",
      "company": {
        "name": "Everclear (ex Connext)",
        "logo": "everclear-(ex-connext).png"
      },
      "tags": [
        "Architecture Design",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "The current issue with token bridges is fragmented liquidity, as each bridge creates its own token version, making cross-chain transfers complex and inefficient."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "xERC20 is a standard for sovereign bridged tokens, offering a unified interface across bridge implementations. It removes liquidity constraints while allowing token issuers to regain full ownership and improve the on-chain user experience."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/xERC20"
        ],
        "docs": ["https://www.xerc20.com/"]
      }
    },
    {
      "name": "Everclear",
      "company": {
        "name": "Everclear (ex Connext)",
        "logo": "everclear-(ex-connext).png"
      },
      "tags": [
        "Architecture Design",
        "Idea Generation",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Liquidity management across multiple chains has been highly inefficient and costly for solvers, market makers, and centralized exchanges. Fragmentation of liquidity has made it difficult to scale operations and optimize cross-chain rebalancing, especially with the increasing number of chains and assets. Traditional manual processes and centralized solutions have been resource-intensive, limiting the scalability of liquidity rebalancing across decentralized networks."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Everclear automates cross-chain liquidity settlement, reducing costs and complexity by netting flows across chains. It leverages Chain Abstraction, allowing seamless rebalancing without manual intervention. The system also uses a Dutch auction to clear invoices efficiently and introduces the vbNEXT token model to direct liquidity to underutilized chains, aligning incentives for all participants."
        }
      },
      "status": "Completed",
      "links": {
        "website": ["https://www.everclear.org/"],
        "twitter": [],
        "github": [],
        "docs": ["https://docs.everclear.org/"]
      }
    },
    {
      "name": "Optimistic Merkle Root Aggregator",
      "company": {
        "name": "Everclear (ex Connext)",
        "logo": "everclear-(ex-connext).png"
      },
      "tags": [
        "Idea Generation",
        "Off-Chain",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Canonical bridge implementations, while functional, are often costly and inefficient due to their dependency on Arbitrary Message Bridges (AMBs) and the need for on-chain root calculations. These processes increase the operational overhead and introduce potential bottlenecks, making cross-chain transfers slower and more expensive for users."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "This project significantly reduces costs and increase transfer speeds by implementing an Optimistic approach with cross-chain Merkle root aggregations."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/connext/monorepo/pull/4951/"
        ],
        "docs": []
      }
    },
    {
      "name": "HAI",
      "company": {
        "name": "Reflexer",
        "logo": "reflexer.png"
      },
      "tags": [
        "Refactoring",
        "Research",
        "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "While RAI addresses fiat-pegged volatility with an on-chain controlled peg mechanism, it still faces adoption challenges in a multichain DeFi environment. Relying solely on ETH as collateral limits its appeal, as users miss out on staking rewards from other assets. Additionally, cross-chain liquidity is increasingly necessary for managing collateral and liquidity across ecosystems, given the fragmented nature of these assets."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We developed HAI, a decentralized stablecoin deployed on Optimism that simplifies liquidity management across multiple tokens. HAI supports a diverse range of collateral types, including ETH, OP, LSDs, and RAI, making it more flexible and attractive to users. This consolidated approach enhances liquidity stability and facilitates broader DeFi adoption."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://www.letsgethai.com/#/safes", "https://github.com/hai-on-op/core"
        ],
        "docs": []
      }
    },
    {
      "name": "Distributor",
      "company": {
        "name": "EigenLayer",
        "logo": "eigenlayer.png"
      },
      "tags": ["Architecture Design", "Off-Chain", "Smart Contracts"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Ensure that sufficient verifiable information is collected from participants to meet regulatory requirements and execute the airdrop fairly. The process must remain compliant while also being user-friendly, secure, and scalable."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We developed the SignedDistributor contract to streamline the airdrop process. This contract uses off-chain signatures to verify claims, ensuring that only eligible participants from approved regions—excluding those in prohibited or sanctioned areas—can claim tokens. The process involved creating scripts to process the eligibility data CSV provided by Eigenlayer, preparing it for backend integration."
        }
      },
      "status": "Completed",
      "links": {
        "website": ["https://etherscan.io/address/0x035bdAeaB85E47710C27EdA7FD754bA80aD4ad02#code"],
        "twitter": [],
        "github": []
      }
    },
    {
      "name": "Allo v2.1",
      "company": {
        "name": "Gitcoin",
        "logo": "gitcoin.png"
      },
      "tags": [
        "Research", "Smart Contracts"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Allo offers various mechanisms for allocating and distributing funds, referred to as strategies. These strategies often share similar actions or custom logic, making the development experience cumbersome due to unclear processes and repetitive code. The challenge was to simplify this by making strategies more modular and flexible."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "In Allo v2.1, we adopted a modular design similar to OpenZeppelin’s approach, introducing tools like the BaseStrategy contract, which serves as a foundation for defining strategies. Alongside this, we provided extension contracts and libraries that developers can easily inherit to create custom strategies, streamlining the process."
        }
      },
      "status": "Completed",
      "links": {
        "website": ["https://www.allo.capital/"],
        "twitter": [],
        "github": ["https://github.com/allo-protocol"],
        "docs": ["https://handbook.wonderland.xyz/blog/allo-explained"]
      }
    },
    {
      "name": "Safe Liveness",
      "company": {
        "name": "Safe",
        "logo": "safe.png"
      },
      "tags": [
        "Architecture Design",
        "Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Safe smart wallets on different chains were deployed as separate contracts despite having the same configuration. This causes synchronization issues when changes, such as owner modifications, are made on one chain but not reflected on others, leading to inconsistent security settings across chains. The challenge is to ensure that these configurations are synchronized across chains in a trust-minimized way, especially during security changes."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We developed this Safe Liveness module that uses shared cryptographic proofs to verify Safe settings across chains. This module would allow users to batch verify and broadcast changes, ensuring that any updates made on one chain are propagated to all others. So, we will have a master safe, which other deployments will be listening to.\n\nThe Liveness module can verify Safe ownership based on storage proof and keep everything cross-chain synced."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/safe-liveness"
        ],
        "docs": []
      }
    },
    {
      "name": "Spells",
      "company": {
        "name": "Sky",
        "logo": "sky.png"
      },
      "tags": ["Reviewers"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Sky (formerly MakerDAO) is one of the largest and oldest governance systems in DeFi. It oversees a significant number of on-chain votes that need to be executed daily. These votes can include payments, parameter adjustments within vaults, or contract updates, collectively referred to as spells."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Review and craft spells before they are executed on Ethereum Mainnet."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": []
      }
    },
    {
      "name": "Extensible Minting",
      "company": {
        "name": "Corn",
        "logo": "corn.png"
      },
      "tags": [
        "Research", "Smart Contracts", "Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "On Ethereum, BTCN can be minted and burned under governance control, but on Corn (an Arbitrum Orbit chain) those actions are restricted. This prevents governance-approved actors from creating or withdrawing BTCN supply directly, limiting functionality for lending, arbitrage, and custodial minting. Without a workaround, Corn cannot fully support key financial primitives such as flash loans, lending markets, or stablecoin issuance backed by BTC collateral."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Instead of minting and burning, governance-approved addresses can borrow BTCN from a pre-minted supply stored in the BTCN OFT contract. This mechanism enables flash loans to improve arbitrage opportunities, lending markets (with Morpho as the first integration), and permissioned minting for custodians to issue stablecoins like USDT0 against BTC collateral. We implemented the necessary contract upgrades (borrow/repay logic, limits), build a flash loan module, clean up unused ERC20 functionality, address feedback on governance contracts, and prepare off-chain tooling."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [],
        "docs": []
      }
    },
    {
      "name": "Morpho Module",
      "company": {
        "name": "Corn",
        "logo": "corn.png"
      },
      "tags": [
        "Architecture Design",
        "Development"
      ],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Corn introduces a unique Arbitrum Orbit Layer 2 environment where BTCN acts as the native gas token, pre-minted and managed through the BitcornOFTAdapter contract. While this system unlocks powerful liquidity capabilities, it also created a challenge: efficiently deploying the pre-minted wBTCN liquidity into real yield-generating ecosystems like Morpho without requiring additional collateralization or bridging from Ethereum L1. Corn governance needed a secure, onchain mechanism to deepen liquidity in Morpho while maintaining strict control over borrowed assets and preserving the integrity of the BTCN supply."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "To solve this, the Corn team developed the Morpho Module — a dedicated contract that acts as a bridge between Corn’s pre-minted wBTCN liquidity and Morpho’s MetaMorpho vaults. The module allows permissioned actors to borrow wBTCN from the BitcornOFTAdapter and deposit it directly into Morpho vaults, automatically managing deposits, withdrawals, and yield collection. Through precise access control and built-in safeguards, Corn governance can safely supply liquidity, capture yield, and strengthen the ecosystem — all without modifying existing BTCN positions or requiring external collateralization."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
        ],
        "docs": []
      }
    }
  ],
  "projects": [
    {
      "name": "ZkChainHub",
      "company": {
        "name": "ZKSync",
        "logo": "zksync.png"
      },
      "tags": ["Architecture Design", "Off-Chain", "UI Development"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Chain operators and dApp developers lack a unified platform to access essential zkChain data, forcing them to rely on scattered tools for ecosystem insights and chain management."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We built ZKchainHub, a streamlined interface that provides key ecosystem statistics and chain-specific data."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": [
          "https://github.com/defi-wonderland/ZKchainHub-backend",
          "https://github.com/defi-wonderland/ZKchainHub-ui"
        ]
      }
    },
    {
      "name": "Private Oracle",
      "company": {
        "name": "Aztec",
        "logo": "aztec.png"
      },
      "tags": ["Architecture Design", "Development"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Most current oracle systems publish their answers on public blockchains, making the data freely accessible to everyone. This creates a disincentive for data consumers to pay for the information, as they can obtain it without cost. As a result, sustainable funding models for oracle services can be difficult to maintain."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "An optimistic private oracle that uses zero-knowledge proofs to provide a privacy-focused solution. When querying a specific address (referred to as the 'divinity'), both the questions and answers are encrypted, ensuring that only the requester and the divinity can read them—no other party has access. This solution was deployed in the Aztec Network Sandbox as part of the Alpha Partnership Program."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/aztec-private-oracle"]
      }
    },
    {
      "name": "World ID Governor",
      "company": {
        "name": "Worldcoin",
        "logo": "worldcoin.png"
      },
      "tags": ["Architecture Design", "Idea Generation", "Smart Contracts"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "DAO governance models face challenges such as Sybil attacks, where individuals use multiple accounts to gain unfair voting power. These models lack the ability to verify that voters are unique humans, undermining the fairness and democratic nature of governance systems."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We developed a WorldID-based Governor, composed of the GovernorWorldID and GovernorDemocratic, to ensure orb-verified humans can participate in DAO schemes. It implements mechanisms such as 1 person = 1 vote."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/world-id-governor-core"]
      }
    },
    {
      "name": "Keep3r Network V2",
      "company": {
        "name": "Keep3r",
        "logo": "keep3r.png"
      },
      "tags": ["Refactoring", "Architecture Design", "Development", "Research"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "The original Keep3r Network faced limitations with cross-chain automation and lacked the ability to operate seamlessly across multiple blockchains. This led to difficulties for job providers and keepers in managing decentralized tasks, particularly those involving cross-chain data and liquidity."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "We rebuilt the protocol from scratch with a multichain system that uses Connext Network’s data bridging for cross-chain automation. The new reward mechanism incentivizes keepers by covering costs and ensuring profitability, while updated scripts make job creation more accessible for both keepers and job providers."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/keep3r-network/keep3r-network-v2"]
      }
    },
    {
      "name": "Sidechain Oracles",
      "company": {
        "name": "Keep3r",
        "logo": "keep3r.png"
      },
      "tags": ["Off-Chain", "Architecture Design", "Smart Contracts"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "The main challenge was to provide reliable and consistent price data for Uniswap V3 pools on sidechains or chains where the liquidity pairs either do not exist or lack sufficient liquidity to offer accurate pricing. This situation made it difficult for developers and applications to access historical price data across different chains."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "The Sidechain Oracles system solves this by broadcasting price data from the mainnet Uniswap V3 pools to sidechains. It periodically updates the oracle information based on time-weighted average price (TWAP) calculations, triggered either by time intervals or significant changes in price. The system ensures data consistency by storing and updating price history on sidechains, allowing any contract to access this data as if querying a Uniswap pool directly. It also incentivizes permissionless participation by rewarding those who trigger data updates or broadcasts across chains."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/sidechain-oracles"]
      }
    }
  ],
  "publicGoods": [
    {
      "name": "Canon Guard",
      "company": {
        "name": "Public Good",
        "logo": "public-good.png"
      },
      "tags": ["Architecture Design", "Development", "Idea Generation", "Smart Contracts"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Safe proposals and signatures happen off-chain, which creates blind spots: payloads can drift or be misrepresented, signers may see different views, and stale signatures can linger. There’s no single on-chain source of truth, approvals aren’t auditable end-to-end, and fast paths increase signer fatigue and operational risk for high‑stakes transactions."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Canon Guard moves intent on-chain. Transactions are encoded as immutable on-chain Actions, queued with explicit delays (short for pre‑approved flows; long for new ones), and approved on-chain via the exact Safe tx hash. A Safe guard (OnlyCanonGuard) enforces execution through Canon Guard, while an emergency mode restricts execution authority under duress. The result is transparent, simulatable, and auditable operations that reduce signer fatigue and spoofing risk."
        }
      },
      "status": "In progress",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/canon-guard", "https://github.com/defi-wonderland/canon-guard-docs"]
      }
    },
    {
      "name": "Natspec Smells",
      "company": {
        "name": "Public Good",
        "logo": "public-good.png"
      },
      "tags": ["Architecture Design", "Development", "Idea Generation"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Incomplete or missing natspec documentation in Solidity contracts can cause misunderstandings and reduce code clarity."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Natspec Smells automatically detects missing or incomplete natspec comments, verifying constructors, functions, and other elements. It ensures proper documentation and integrates easily into development workflows."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/natspec-smells"]
      }
    },
    {
      "name": "Sponsored Transactions",
      "company": {
        "name": "Public Good",
        "logo": "public-good.png"
      },
      "tags": ["Architecture Design", "Development", "Idea Generation"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Sending transactions on Ethereum and other EVM chains requires users to hold native tokens to cover gas fees, adding friction to the user experience."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "A plugin that enables developers to sponsor transactions through account abstraction, allowing users to submit transactions without paying gas fees."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/hardhat-account-abstraction"]
      }
    },
    {
      "name": "Governor sucks",
      "company": {
        "name": "Public Good",
        "logo": "public-good.png"
      },
      "tags": ["Architecture Design", "Development", "Idea Generation"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Current DAO governance systems lack flexibility in delegation, forcing users to delegate all their voting power to a single delegate. Additionally, existing governance contracts don't support different proposal types for varying needs like legal or technical matters, limiting the efficiency and transparency of the governance process."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Wonderland Governor offers a flexible governance solution, enabling users to delegate their voting power to multiple delegates based on proposal type. Built on OpenZeppelin contracts, it introduces new features such as smart delegation and partial delegation, addressing the limitations of current governance protocols."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/wonderland-governooor-poc"]
      }
    },
    {
      "name": "Smock",
      "company": {
        "name": "Public Good",
        "logo": "public-good.png"
      },
      "tags": ["Architecture Design", "Development", "Idea Generation"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Testing smart contracts in Solidity often requires developers to manually write mock contracts, adding complexity and slowing down the testing process. This results in redundant code and increased effort for even simple tests."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Smock is a Solidity mocking library and Hardhat plugin, used by approximately 800 repositories. It enables developers to create mock Solidity contracts using JavaScript and TypeScript, simplifying smart contract testing and eliminating the need for Solidity mock contracts. Inspired by sinon, sinon-chai, and Python's unittest.mock, Smock currently supports only Hardhat, with plans to expand to other frameworks like Truffle."
        }
      },
      "status": "Completed",
      "links": {
        "website": [],
        "twitter": [],
        "github": ["https://github.com/defi-wonderland/smock"],
        "docs": ["https://smock.readthedocs.io/en/latest/"]
      }
    },
    {
      "name": "Price Oracle",
      "company": {
        "name": "Public Good",
        "logo": "public-good.png"
      },
      "tags": ["Architecture Design", "Idea Generation", "Off-Chain", "Smart Contracts", "UI Development"],
      "content": {
        "challenge": {
          "title": "What was the challenge?",
          "description": "Uniswap V3 provides decentralized price data but faces issues like trust concerns, complexity in managing liquidity, and vulnerability to multi-block attacks, limiting its use as a reliable oracle for price quotes."
        },
        "solution": {
          "title": "What is the solution?",
          "description": "Price is a permissionless oracle built on Uniswap V3 that automates liquidity management and detects price manipulations. By addressing trust, complexity, and multi-block attack vulnerabilities, it delivers safe and reliable price data for any existing token without user intervention."
        }
      },
      "status": "Completed",
      "links": {
        "website": ["https://oracles.rip/"],
        "twitter": [],
        "github": ["https://github.com/price-oracle/v1-core"],
        "docs": ["https://docs.oracles.rip/"]
      }
    }
  ]
}
