[
  {
    "text": "Collaborating with Wonderland is an instant force multiplier on a project. Not only are they as rigorous as it gets when it comes to security, they are also as crypto native as it gets. Wouldn't be surprised at all if they somehow played a part in the revolution.",
    "author": {
      "position": "Co-Founder",
      "company": "Optimism",
      "name": "Mark Tyneway",
      "avatar": "/img/quotes/optimism-pfp.jpg"
    },
    "logo": "/img/quotes/optimism-logo.jpg",
    "link": "https://www.optimism.io/"
  },
  {
    "text": "Wonderland was wonderful to work with. They aren’t cheap but they do excellent work. They went above and beyond their assignment and even found & fixed a bug in a related system, following our communication guidelines for risk mitigation at every step. 10/10 would recommend.",
    "author": {
      "position": "Co-Founder",
      "company": "Reflexer",
      "name": "Ameen",
      "avatar": "/img/quotes/reflexer-pfp.jpg"
    },
    "logo": "/img/quotes/reflexer-logo.png",
    "link": "https://reflexer.finance/"
  },
  {
    "text": "Wonderland is an incredibly talented technical team that takes a radically different approach to how they work with protocols. They are a close partner & core contributor to the Connext ecosystem, taking a proactive leadership role in not only building, but also helping determine what the future of the network will look like. I strongly recommend them to anyone looking for a high integrity, high quality partner.",
    "author": {
      "position": "Co-Founder",
      "company": "Everclear",
      "name": "Arjun",
      "avatar": "/img/quotes/connext-pfp.jpg"
    },
    "logo": "/img/quotes/connext-logo.jpg",
    "link": "https://www.everclear.org/"
  },
  {
    "text": "Wonderland has been an exceptional partner, consistently showing rigor, flexibility, and professionalism. Their attention to detail ensures every project is handled with precision, while their adaptability allows them to meet evolving needs. Above all, their alignment with our values makes them a trusted collaborator, always striving for excellence and impact.",
    "author": {
      "position": "Co-Founder",
      "company": "Gitcoin",
      "name": "Kevin Owocki",
      "avatar": "/img/quotes/gitcoin-pfp.jpg"
    },
    "logo": "/img/quotes/gitcoin-logo.jpg",
    "link": "https://www.gitcoin.co/"
  },
  {
    "text": "Great working together, if I could, I would have them run the protocol full time, complete trust.",
    "author": {
      "position": "Founder",
      "company": "Keep3r",
      "name": "Andre Cronje",
      "avatar": "/img/quotes/keep3r-pfp.jpg"
    },
    "logo": "/img/quotes/keep3r-logo.png",
    "link": "https://keep3r.network/"
  },
  {
    "text": "The Wonderland team has been instrumental in helping us push the design space for Aztec and think better about the types of contracts that can be built on Aztec. They are knowledgeable, motivated, and efficient in their work.",
    "author": {
      "position": "Co-Founder",
      "company": "Aztec",
      "name": "Joe",
      "avatar": "/img/quotes/aztec-pfp.jpg"
    },
    "logo": "/img/quotes/aztec-logo.jpg",
    "link": "https://aztec.network/"
  }
]
